FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/УпущенныйСпрос.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УпущенныйСпрос</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОстаток</Name>
					<Comment>Остаток номенклатуры на складах на момент добавления</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Comment>Причина по которой был упущен спрос</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныУпущенногоСпроса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗапроса</Name>
					<Comment>Источник запроса</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиЗапроса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Comment>Номенклатура</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Пользователь, создавший запись о номенклатуре</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата создания записи о номенклатуре</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИностранное</Name>
					<Comment>Иностранное наименование</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Код производителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Comment>Тип номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Comment>Вид номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Comment>Вид платежа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Comment>Базовая единица измерения номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяЕдиницаИзмерения</Name>
					<Comment>Основная единица измерения номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Comment>Используется для ведения дополнительного учета валютной себестомости и цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияДопРасходов</Name>
					<Comment>Заполняется только для услуг и управляет распределением суммы по услуге в пределах документа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаспределенияДопРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДопРасходов</Name>
					<Comment>Заполняется для услуг. По этой статье происходит начисление расходов / доходов при поставке / отгрузке</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Comment>Страна происхождения по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХраненияТовара</Name>
					<Comment>(в днях) из конфигурации Торговый Комплекс</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Comment>Процент наценки по умолчанию (для расчета цен)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаАвтокаталога</Name>
					<Comment>Индекс картинки номенклатуры в автокаталоге</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаНДСПоРеализации</Name>
					<Comment>Счет учета НДС по реализации используется при выгрузке в бухгалтерию</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Регламентированный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьПоставок</Name>
					<Comment>Количество, которое можем заказывать у поставщика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятаСПроизводства</Name>
					<Comment>Номенклатура снята с производства</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретПродажи</Name>
					<Comment>Запрет продажи номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретЗакупки</Name>
					<Comment>Запрет закупки номенклатуры</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Comment>Обычно соответствует массе Брутто в основной единице измерения массы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Comment>Соотвестует объему в основной единице измерения объема</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Comment>Артикул для поиска</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКПД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКПД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прослеживаемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SafetyStock</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_ИсключитьОтслеживаниеНепродТов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставНабора</Name>
					<Comment>Состав набора</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЯчейкиХраненияУдалить</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СкладКомпании</Name>
							<Comment>Склад компании</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаХранения</Name>
							<Comment>Ячейка хранения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/УпущенныйСпрос/Ext/ManagerModule.bsl
Функция ПодставитьПараметрыВСтроку(СтрокаСПараметрами, Параметр1 = Неопределено, Параметр2 = Неопределено, Параметр3 = Неопределено, Параметр4 = Неопределено)
	СтрокаСПараметрами = СтрЗаменить(СтрокаСПараметрами, "%1", Параметр1);
	СтрокаСПараметрами = СтрЗаменить(СтрокаСПараметрами, "%2", Параметр2);
	СтрокаСПараметрами = СтрЗаменить(СтрокаСПараметрами, "%3", Параметр3);
	СтрокаСПараметрами = СтрЗаменить(СтрокаСПараметрами, "%4", Параметр4);
	Возврат СтрокаСПараметрами;
КонецФункции

//Процедура заполняет артикул а также преобразует артикул для поиска
Процедура ЗаполнитьАртикулДляПоиска() Экспорт 
	
	#Если Клиент Тогда
	Состояние(НСтр("ru='Проверка упущенного спроса.'"));
	#КонецЕсли
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УпущенныйСпрос.Производитель КАК Производитель,
		|	УпущенныйСпрос.Период,
		|	УпущенныйСпрос.АртикулДляПоиска,
		|	УпущенныйСпрос.Количество,
		|	УпущенныйСпрос.КоличествоОстаток,
		|	УпущенныйСпрос.Автор,
		|	УпущенныйСпрос.Комментарий,
		|	УпущенныйСпрос.Номенклатура,
		|	УпущенныйСпрос.Причина,
		|	УпущенныйСпрос.ИсточникЗапроса
		|ИЗ
		|	РегистрСведений.УпущенныйСпрос КАК УпущенныйСпрос
		|ГДЕ
		|	УпущенныйСпрос.Артикул = """"
		|ИТОГИ ПО
		|	Производитель";
	
	Результат = Запрос.Выполнить();
				   
	Если Результат.Пустой() Тогда
		#Если Клиент Тогда
		Сообщить(НСтр("ru='Обновление регистра сведений ""Упущенный спрос"" не требуется'"));
		#КонецЕсли
		Возврат;
	КонецЕсли;
		
	#Если Клиент Тогда
	Сообщить(НСтр("ru='Обновление регистра сведений ""Упущенный спрос""'"));
	#КонецЕсли
	
	ВыборкаПроизводителей = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	РазмерВыборки = ВыборкаПроизводителей.Количество();
	СчВсего = 0;
	ПроцентПрогресса = 0;
	
	Пока ВыборкаПроизводителей.Следующий()Цикл
		
		ПроизводительНаименование = ?(обЗначениеНеЗаполнено(ВыборкаПроизводителей.Производитель), "<Не указан>", ВыборкаПроизводителей.Производитель.Наименование);
		
		СчВсего = СчВсего + 1;
		#Если Клиент Тогда
		// Прогресс устроим по производителям
		Если Цел(СчВсего*100/РазмерВыборки) > ПроцентПрогресса Тогда
			ПроцентПрогресса = Цел(СчВсего*100/РазмерВыборки);
			Состояние(ПодставитьПараметрыВСтроку(НСтр("ru='Обновление регистра сведений ""Упущенный спрос"": %1%, производитель %2'"),
												 Строка(ПроцентПрогресса),
												 ПроизводительНаименование));
		КонецЕсли;
		#КонецЕсли
		
		НачатьТранзакцию();		
		
		НаборЗаписей = РегистрыСведений.УпущенныйСпрос.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Производитель.Установить(ВыборкаПроизводителей.Производитель, Истина);
		НаборЗаписей.Прочитать();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		
		#Если Клиент Тогда
		Если НаборЗаписей.Количество() > 20000 Тогда
			// Будем сообщать только о существенных производителях
			Сообщить(ПодставитьПараметрыВСтроку(НСтр("ru='Для производителя %1 в регистре найдено %2 записей. Обновление может занять длительное время. Подождите!'"),
												ПроизводительНаименование,
												Строка(НаборЗаписей.Количество())));
		КонецЕсли;
		#КонецЕсли
											
		// Если набор записей содержит меньше 100000 записей,
		// то отредактируем и запишем сразу весь набор. Это еще более менее терпимо по нагрузке на сервер
		// Если записей больше, то очистим набор и построчно создадим новый
		
		Если НаборЗаписей.Количество() > 100000 Тогда
			
			// Весь набор нельзя удалять, так как могут быть записи, которых в запрос не попало!
			НаборЗаписей = Неопределено;
			//НаборЗаписей.Очистить();
			//НаборЗаписей.Записать(Истина);
			
			ДетальнаяВыборка = ВыборкаПроизводителей.Выбрать();
			
			СчЦикла = 0;
			
			Пока  ДетальнаяВыборка.Следующий() Цикл
				
				СчЦикла = СчЦикла + 1;
				
				Артикул = СокрЛП(ДетальнаяВыборка.АртикулДляПоиска);
				АртикулДляПоиска = Справочники.Номенклатура.ПреобразоватьВАртикулДляПоиска(Артикул, ДетальнаяВыборка.Производитель); 
				Если ПустаяСтрока(АртикулДляПоиска)Тогда
					АртикулДляПоиска = СокрЛП(Артикул);
				КонецЕсли;
				
				РабочийНабор = РегистрыСведений.УпущенныйСпрос.СоздатьНаборЗаписей();
				РабочийНабор.Отбор.Производитель.Установить(ДетальнаяВыборка.Производитель,	Истина);
				РабочийНабор.Отбор.Период.		 Установить(ДетальнаяВыборка.Период,		Истина);
				
				Если СокрП(ДетальнаяВыборка.АртикулДляПоиска) <> АртикулДляПоиска Тогда
					// Артикул изменился, надо удалить старую запись и создать новую
					РабочийНабор.Отбор.АртикулДляПоиска.Установить(ДетальнаяВыборка.АртикулДляПоиска,	Истина);
					РабочийНабор.ОбменДанными.Загрузка = Истина;
					РабочийНабор.Записать(Истина);
				КонецЕсли;
				
				РабочийНабор.Отбор.АртикулДляПоиска.Установить(АртикулДляПоиска, Истина);
				
				НоваяЗапись = РабочийНабор.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ДетальнаяВыборка);
				НоваяЗапись.Артикул          = Артикул;
				НоваяЗапись.АртикулДляПоиска = АртикулДляПоиска;
				
				РабочийНабор.ОбменДанными.Загрузка = Истина;
				РабочийНабор.Записать(Истина);
				
				Если СчЦикла >= 10000 Тогда
					ЗафиксироватьТранзакцию();
					НачатьТранзакцию();
					СчЦикла = 0;
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Для Каждого Запись ИЗ НаборЗаписей Цикл 
				Артикул			 = Запись.АртикулДляПоиска;
				АртикулДляПоиска = Справочники.Номенклатура.ПреобразоватьВАртикулДляПоиска(Артикул, Запись.Производитель);
				
				Запись.Артикул = Артикул;
				Если НЕ ПустаяСтрока(АртикулДляПоиска)Тогда
					Запись.АртикулДляПоиска = АртикулДляПоиска;
				КонецЕсли;	
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;
	
	#Если Клиент Тогда
	Сообщить(НСтр("ru='Обновление регистра сведений ""Упущенный спрос"" завершено.'"));
	#КонецЕсли
	
КонецПроцедуры //ЗаполнитьАртикулДляПоиска()
